#
#  Базовые операции языка
#




# Объявление переменных
a = 11
d = 10_000  #Эквивалентно d=10000
# Возведение в степень
b = a**2
bb = pow(a, 2)
# Деление
c   = a / 2
cc  = a // 2  #Деление нацело
ccc = a % 2	  #Остаток от деления

# Вывод данных
print(10)
print(a)
print(f"Остаток от деления {ccc}")
print("Hello world")
print("Hello", "YourName", sep = "_", end = "\n")

# Ввод данных
# your_name = input("Введите ваше имя: ")
# your_age = int(input("Введите ваш возраст: "))  # преобразовали в int число
